Ran Plan for project: `animeutopia-prod` dir: `accounts/animeutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-animeutopia.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/nonprod-ue2-animeutopia.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/prod-ue2-sharedservices.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/nonprod-ue2-sharedservices.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.s3_full_policy will be created
+ resource "aws_iam_policy" "s3_full_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow Lambda full access to S3 for the prod-animeutopia-media-bucket"
      + id               = (known after apply)
      + name             = "anime_s3_full_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::prod-animeutopia-media-bucket",
                          + "arn:aws:s3:::prod-animeutopia-media-bucket/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy" = "Terraform"
        }
    }

  # aws_iam_policy.s3_list_and_get_policy will be destroyed
  # (because aws_iam_policy.s3_list_and_get_policy is not in configuration)
- resource "aws_iam_policy" "s3_list_and_get_policy" {
      - arn              = "arn:aws:iam::481665084477:policy/anime_s3_full_policy" -> null
      - attachment_count = 1 -> null
      - description      = "Policy to allow Lambda full access to S3 for the prod-animeutopia-media-bucket" -> null
      - id               = "arn:aws:iam::481665084477:policy/anime_s3_full_policy" -> null
      - name             = "anime_s3_full_policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::prod-animeutopia-media-bucket",
                          - "arn:aws:s3:::prod-animeutopia-media-bucket/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAXAJLZ5Q64J2P7YJS6" -> null
      - tags             = {} -> null
      - tags_all         = {
          - "DeployedBy" = "Terraform"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.attach_s3_list_and_get_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "attach_s3_list_and_get_policy" {
      ~ id         = "anime_lambda_role-20250227172628368500000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::481665084477:policy/anime_s3_full_policy" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_s3_bucket.media_bucket,
│   on main.tf line 8, in resource "aws_s3_bucket" "media_bucket":
│    8: resource "aws_s3_bucket" "media_bucket" {
│ 
│ Use the aws_s3_bucket_versioning resource instead
│ 
│ (and 3 more similar warnings elsewhere)
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p animeutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://18.217.82.45:4141/lock?id=ryan-longoria%252FFeedMatrix%252Faccounts%252Fanimeutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p animeutopia-prod
  ```
Plan: 2 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```